# UpdateVP

## Description
Updates the specified viewport: a dirty viewport, whose render type is other than wireframe, will be re-rendered.

```pascal
PROCEDURE UpdateVP(viewportHandle : HANDLE);
```

```python

def vs.UpdateVP(viewportHandle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|viewportHandle|HANDLE|Handle to a viewport|

## Version
Availability: from VectorWorks11.0
## Category
* Objects - Groups